#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	
	Если ВидФормы = "ФормаОбъекта" Тогда 
		
		СтандартнаяОбработка = Ложь;   
				
		ТекущаяТочкаМаршрута = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ,"ТочкаМаршрута");
     		
		Если ТекущаяТочкаМаршрута = БизнесПроцессы.ПередачаЗаказаВОМТС.ТочкиМаршрута.СогласоватьЗаказ Тогда
			ВыбраннаяФорма = "Задача.ЗадачиИсполнителейПТО.Форма.ФормаЗадачиСогласоватьЗаказ"; 
		
		ИначеЕсли ТекущаяТочкаМаршрута = БизнесПроцессы.ПередачаЗаказаВОМТС.ТочкиМаршрута.ДоработатьЗаказ Тогда
			ВыбраннаяФорма = "Задача.ЗадачиИсполнителейПТО.Форма.ФормаЗадачиОтправитьНаСогласование";
			
		ИначеЕсли ТекущаяТочкаМаршрута = БизнесПроцессы.ПередачаЗаказаВОМТС.ТочкиМаршрута.ОтправитьВОМТС Тогда
			ВыбраннаяФорма = "Задача.ЗадачиИсполнителейПТО.Форма.ФормаЗадачиОтправитьВОМТС";
	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
