
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если Врег(ИмяСобытия) = Врег("Запись_ЗадачиЗадачиИсполнителейОМТС")
		ИЛИ ИмяСобытия = "Запись_ЗадачиЗадачиИсполнителейПТО" Тогда 
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Пользователи.РолиДоступны("ПолныеПрава") Тогда		
		Список.ОсновнаяТаблица = "Задача.ЗадачиИсполнителейОМТС";
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
