#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если  Параметры.Свойство("ЕдиницаИзмеренияПоставщика") Тогда 
		ЕдиницаИзмеренияПоставщика = Параметры.ЕдиницаИзмеренияПоставщика;	
	КонецЕсли;
	
	Если  Параметры.Свойство("ЕдиницаИзмеренияПотребности") Тогда 
		ЕдиницаИзмеренияПотребности = Параметры.ЕдиницаИзмеренияПотребности;
	КонецЕсли;
	
	Если  Параметры.Свойство("НоменклатураПоставщика") Тогда 
		НоменклатураПоставщика = Параметры.НоменклатураПоставщика;	
	КонецЕсли;                                                 
	
	Если  Параметры.Свойство("НоменклатураПотребности") Тогда 
		НоменклатураПотребности = Параметры.НоменклатураПотребности;		
	КонецЕсли;    
	
	Если  Параметры.Свойство("БазоваяЕдиницаИзмерения") Тогда 
		БазоваяЕдиницаИзмерения = Параметры.БазоваяЕдиницаИзмерения;
	КонецЕсли; 	   
	
	Если  Параметры.Свойство("КоэффициентЕдиницыИзмерения") Тогда 
		КоэффициентЕдиницыИзмерения = Параметры.КоэффициентЕдиницыИзмерения;
	КонецЕсли; 	

	Если ЕдиницаИзмеренияПоставщика = БазоваяЕдиницаИзмерения Тогда
		КоличествоПоставщика = КоэффициентЕдиницыИзмерения;
		КоличествоПотребность = 1;
	ИначеЕсли ЕдиницаИзмеренияПотребности = БазоваяЕдиницаИзмерения Тогда
		КоличествоПоставщика = 1;
		КоличествоПотребность = КоэффициентЕдиницыИзмерения;
	
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПоставщика1ПриИзменении(Элемент)
	
	Если ЕдиницаИзмеренияПоставщика = ЕдиницаИзмеренияПотребности Тогда
		КоличествоПоставщика = 1;
		КоличествоПотребность = 1;
		КоэффициентЕдиницыИзмерения = 1;
	КонецЕсли;  
	
	Если КоличествоПоставщика < 0  Тогда
		КоличествоПоставщика = 0;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Количество не может быть ментше 0",,"КоличествоПоставщика");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПотребностьПриИзменении(Элемент)
	
	Если ЕдиницаИзмеренияПоставщика = ЕдиницаИзмеренияПотребности Тогда
		КоличествоПоставщика = 1;
		КоличествоПотребность = 1;
		КоэффициентЕдиницыИзмерения = 1;
	КонецЕсли; 
	
	Если КоличествоПотребность < 0  Тогда
		КоличествоПотребность = 0;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Количество не может быть ментше 0",,"КоличествоПотребность");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИЗакрыть(Команда)
	
	
	
	Если КоличествоПоставщика <> 0 И КоличествоПотребность <> 0 Тогда  
		
		ПараметрыЗакрытияФормы = Новый Структура;
		Если КоличествоПоставщика >= КоличествоПотребность Тогда
			ПараметрыЗакрытияФормы.Вставить("БазоваяЕдиницаИзмерения",ЕдиницаИзмеренияПоставщика);
			ПараметрыЗакрытияФормы.Вставить("КоэффициентЕдиницыИзмерения", КоличествоПоставщика/КоличествоПотребность);
		Иначе      
			ПараметрыЗакрытияФормы.Вставить("БазоваяЕдиницаИзмерения",ЕдиницаИзмеренияПотребности);
			ПараметрыЗакрытияФормы.Вставить("КоэффициентЕдиницыИзмерения", КоличествоПотребность/КоличествоПоставщика);			
			
		КонецЕсли;  
		
		Закрыть(ПараметрыЗакрытияФормы);
		
	Иначе 
		
		ОповещениеЗадатьВопрос = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма);
		ТекстВопроса = "Данные заполнены не корректно.
		|Закрыть без результата обработки?";
		ПоказатьВопрос(ОповещениеЗадатьВопрос,ТекстВопроса,РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Ошибка заполнения данными"); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса (Результат, Параметр) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


