#Область ОбработчикиСобытийФормы    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса()); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_РегистрСведенийРуководителиПроектов" 
		ИЛИ ИмяСобытия = "Запись_РегистрСведенийРаспределениеВыполняемыхРаботПоПодрядчикам" Тогда 
		
		Элементы.Список.Обновить(); 
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти




