#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Заголовок = СтрШаблон("Выбор номеклатуры из внутреннего заказа №%1", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ВнутреннийЗаказ,"Номер")); 
	Список.Параметры.УстановитьЗначениеПараметра("Ссылка", Параметры.ВнутреннийЗаказ);
	
КонецПроцедуры

#КонецОбласти  


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	 ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	 Если ТекущиеДанные = Неопределено Тогда 
	     Возврат;
	 КонецЕсли;
	 
	 ВыбранноеЗначение = Новый Структура("Номенклатура, ДополнительныеХарактеристикиНоменклатуры,ЕдиницаИзмеренияЗаказа,Количество");
	 ЗаполнитьЗначенияСвойств(ВыбранноеЗначение,ТекущиеДанные);
	 
	 ОповеститьОВыборе(ВыбранноеЗначение);

КонецПроцедуры

#КонецОбласти  
