
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_КонстантыОрганизацияПоУмолчанию" Тогда
		
		Элементы.Список.Обновить(); 
		ОбработатьАктивизациюСтрокиСписка();
		 
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСписка", 0.2, Истина); 
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьАктивизациюСтрокиСписка()      

	НастроитьДоступностьКнопкиУстановитьПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьКнопкиУстановитьПоУмолчанию()
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) <> Тип("СправочникСсылка.Организации") 
		ИЛИ  Элементы.Список.ТекущиеДанные.ПоУмолчанию  Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСправочникОрганизацииУстановитьПоУмолчанию.Доступность = Ложь;
	Иначе
		
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСправочникОрганизацииУстановитьПоУмолчанию.Доступность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
  