#Область ОбработчикиСобытийФормы    

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("Заголовок") 
		И ЗначениеЗаполнено(Параметры.Заголовок) Тогда 
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Параметры.Заголовок; 
	КонецЕсли                                    
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
 #КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы   

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить =("Удаление_СправочникДоговорыКонтрагентов)");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти




