
&НаКлиенте
Процедура УстановитьОтветственного(Команда)


	Сотрудник = Элементы.СотрудникОМТС;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнено поле Сотрудник ОМТС";
		Сообщение.Поле = "СотрудникОМТС";
		Сообщение.Сообщить();	
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьРегистрСведений();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРегистрСведений()
	
	Для Каждого ВыбраннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		МенеджерЗаписи = РегистрыСведений.РаспределениеПоИсполнителямОМТС.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписи.ВнутреннийЗаказ = ВыбраннаяСтрока.ВнутреннийЗаказ;
		МенеджерЗаписи.Номенклатура = ВыбраннаяСтрока.Номенклатура;
		МенеджерЗаписи.ЕдиницаИзмерения = ВыбраннаяСтрока.ЕдиницаИзмерения; 
		МенеджерЗаписи.СотрудникОМТС = Элементы.СотрудникОМТС;
		
		МенеджерЗаписи.Записать();
		
		
		//ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыбраннаяСтрока);
		////ДанныеСтроки.СотрудникНовый = СотрудникОМТС;	
		//НаборЗаписей = РегистрыСведений.РаспределениеПоИсполнителямОМТС.СоздатьНаборЗаписей(); 	
		//НаборЗаписей.Отбор.ВнутреннийЗаказ.Установить(ДанныеСтроки.ВнутреннийЗаказ);
		//НаборЗаписей.Отбор.Номенклатура.Установить(ДанныеСтроки.Номенклатура);
		//НаборЗаписей.Отбор.ЕдиницаИзмерения.Установить(ДанныеСтроки.ЕдиницаИзмерения);
		//
		//НоваяЗапись = НаборЗаписей.Добавить();	
		//НоваяЗапись.ВнутреннийЗаказ = ДанныеСтроки.ВнутреннийЗаказ; 
		//НоваяЗапись.Номенклатура = ДанныеСтроки.Номенклатура; 
		//НоваяЗапись.ЕдиницаИзмерения = ДанныеСтроки.ЕдиницаИзмерения;
		//НоваяЗапись.СотрудникОМТС = Элементы.СотрудникОМТС;		
		
		
	КонецЦикла;
	
КонецПроцедуры

