#Область ОбработчикиСобытийФормы   

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	Если Объект.Номер = "" И ЗначениеЗаполнено(Объект.Основание) Тогда
		
		Если Не ДокументыКлиент.ЗаказОтправленВОМТС(Объект.Основание) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для назначения линейного исполнитеоя, заказ должен быть отправлен в ОМТС",,,,Отказ);
			
		КонецЕсли; 
		
		Если  ЗначениеЗаполнено(НайтиДокументЛинейныйИсполнитель(Объект.Основание)) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Для данного заказа уже назначен линейный исполнитель",,,,Отказ);
			
		КонецЕсли;   
		
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если  ЗначениеЗаполнено(Объект.Основание) И  Не ДокументыСервер.ЗаказОтправленВОМТС(Объект.Основание) Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Для назначения линейного исполнитеоя, заказ должен быть отправлен в ОМТС",,"Объект.Основание",,Отказ);		
		
	КонецЕсли;  
	
	Если ИметсяДвойникДокументаЛинейныеИсполнители(Объект.Основание) Тогда 
		
		ОбщегоНазначения.СообщитьПользователю("Для данного заказа уже назначен линейный исполнитель",,"Объект.Основание",,Отказ); 
		
	КонецЕсли;
		
КонецПроцедуры    


#КонецОбласти     

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	Если  ЗначениеЗаполнено(Объект.Основание) И Не ДокументыКлиент.ЗаказОтправленВОМТС(Объект.Основание) Тогда
		
		Объект.Основание = "";
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для назначения линейного исполнитеоя, заказ должен быть отправлен в ОМТС",,"Объект.Основание");		
		
	КонецЕсли;
	
	Если ПолучитьВидПоставки(Объект.Основание) = ПредопределенноеЗначение("Перечисление.ВидПоставки.Заказчиком") Тогда 
		
		Объект.ЗакупщикМатериала = ЗаказчикПоУмолчанию(); 
				
	КонецЕсли;
			
КонецПроцедуры 

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции 

&НаСервере
Функция НайтиДокументЛинейныйИсполнитель(ВнутреннийЗаказ)
	
	Если Не ЗначениеЗаполнено(ВнутреннийЗаказ) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛинейныйИсполнитель.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛинейныйИсполнитель КАК ЛинейныйИсполнитель
		|ГДЕ
		|	ЛинейныйИсполнитель.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Основание", ВнутреннийЗаказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Неопределено; 		
	КонецЕсли;

КонецФункции

&НаСервере
Функция ЗаказчикПоУмолчанию()

	Возврат  Константы.ЗаказчикПоУмолчанию.Получить();
	
КонецФункции

&НаСервере
Функция ПолучитьВидПоставки(ВнутреннийЗаказ)

	Возврат  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание,"ВидПоставки");

КонецФункции


Функция ИметсяДвойникДокументаЛинейныеИсполнители(ВнутреннийЗаказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛинейныйИсполнитель.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛинейныйИсполнитель КАК ЛинейныйИсполнитель
		|ГДЕ
		|	ЛинейныйИсполнитель.Основание = &Основание
		|	И ЛинейныйИсполнитель.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Основание", ВнутреннийЗаказ);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат  Не РезультатЗапроса.Пустой();
	
КонецФункции 

#КонецОбласти  
