
//Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)   
//	СтандартнаяОбработка = Ложь;
//	Поля.Добавить("Ссылка"); 

//КонецПроцедуры

//Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь; 
//		
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	РабочаяДокументация.БазовыйДокумент.Представление КАК БазовыйДокументПредставление,
//		|	РабочаяДокументация.РазделПроекта.Представление КАК РазделПроектаПредставление,
//		|	РабочаяДокументация.Ревизия КАК Ревизия
//		|ИЗ
//		|	Справочник.РабочаяДокументация КАК РабочаяДокументация
//		|ГДЕ
//		|	РабочаяДокументация.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Выборка = РезультатЗапроса.Выбрать();  
//	Выборка.Следующий();   
//	
//	Представление = Выборка.БазовыйДокументПредставление;  
//	
//	Если ЗначениеЗаполнено(Выборка.РазделПроектаПредставление) Тогда
//		Представление = СтрШаблон("%1-%2 %3", Представление,Выборка.РазделПроектаПредставление,Выборка.Ревизия);
//	КонецЕсли;
//КонецПроцедуры
