#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АвтоЗаголовок = Ложь;
	Заголовок = "Обработка внутренних заказов";
	
	Исполнитель = КадрыСервер.ТекущийСотрудник();	
	РазрешитьФильтр = Ложь;
	УстановитьУсловияЗапросаСервер();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если ИмяСобытия = "ВыполненаОбработкаВнутреннегоЗаказа" 
		ИЛИ ИмяСобытия = "ЗаписьРазделительнойВедомости" 
		ИЛИ ИмяСобытия = "ЗаписьСогласияПодрядчикаНаВыполнениеРабот" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура РазрешитьФильтрПриИзменении(Элемент)
	
	УстановитьУсловияЗапросаСервер();
	
КонецПроцедуры 

&НаКлиенте
Процедура ИсполнительОчистка(Элемент, СтандартнаяОбработка)
	
	УстановитьУсловияЗапросаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	УстановитьУсловияЗапросаСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы         

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка= Ложь; 
	Если ТипЗнч(ВыбраннаяСтрока[0]) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("ВнутреннийЗаказ",ВыбраннаяСтрока[0]);
		ОткрытьФорму("Обработка.ОбработкаВнутреннихЗаказов.Форма.Форма",ПараметрыФормы, ЭтаФорма,ВыбраннаяСтрока[0]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции        

&НаСервере
Процедура УстановитьУсловияЗапросаСервер()
	
	Если РазрешитьФильтр Тогда
		
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"ИСТИНА","ВТЗаказыПоИсполнителю.СотрудникОМТС = &СотрудникОМТС");	
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникОМТС", Исполнитель);
		
	Иначе
		
		Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса,"ВТЗаказыПоИсполнителю.СотрудникОМТС = &СотрудникОМТС","ИСТИНА");
		Список.Параметры.УстановитьЗначениеПараметра("СотрудникОМТС", Справочники.Сотрудники.ПустаяСсылка());
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти





