#Область ПрограммныйИнтерфейс

// Функция ищет заказ с точно такимиже реквизитами:
// РабочаяДокументация, ВтдЗаказа, ВариантЗаказа
// Возвращает истина если заказ с такими параметрами уже существует,
// В противном случае возвращает ложь.
Функция НайденДвойникВнутреннегоЗаказа(ВнутреннийЗаказОбъект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнутреннийЗаказ.Номер КАК Номер
	|ИЗ
	|	Документ.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	|ГДЕ
	|	ВнутреннийЗаказ.РабочаяДокументация = &РабочаяДокументация
	|	И ВнутреннийЗаказ.Уточнение = &Уточнение
	|	И ВнутреннийЗаказ.ВидПоставки = &ВидПоставки
	|	И ВнутреннийЗаказ.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Уточнение", ВнутреннийЗаказОбъект.Уточнение);
	Запрос.УстановитьПараметр("ВидПоставки", ВнутреннийЗаказОбъект.ВидПоставки);
	Запрос.УстановитьПараметр("РабочаяДокументация", ВнутреннийЗаказОбъект.РабочаяДокументация);
	Запрос.УстановитьПараметр("Ссылка", ВнутреннийЗаказОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
 
Функция ЗаказПроведен(ВнутреннийЗаказ) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"Проведен"); 
	
КонецФункции

Функция ЗаказОтправленВОМТС(ВнутреннийЗаказ) Экспорт    

    Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"ЗаказОтправленВОМТС"); 
	
КонецФункции

Функция ВнутреннийЗаказСуществуетИНеУдален(ВнутреннийЗаказ) Экспорт 
	
	
	Если ВнутреннийЗаказ = Неопределено 
		Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВнутреннийЗаказ,"ПометкаУдаления") Тогда 
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина; 	
	
КонецФункции

Функция СтавкаНДСПоУмолчанию() Экспорт

	СтавкаНДС = Константы.СтавкаНДСПоУмолчанию.Получить();
	Возврат СтавкаНДС;
	
КонецФункции

Функция ВалютаПоУмолчанию() Экспорт

	Валюта = Константы.ВалютаПоУмолчанию.Получить();
	Возврат Валюта;
	
КонецФункции

Функция СкладПоУмолчанию() Экспорт

	Склад = Константы.СкладПоУмолчанию.Получить();
	Возврат Склад;
	
КонецФункции

Функция ПолучитьПорядковыйНомерНовогоЭлементаТабличнойЧасти(ДокументОбъект, ИмяТабличнойЧасти, ИмяРеквизитаПорядковыйНомер, НомерПервойЗаписи = 1) Экспорт        
	
	Если ДокументОбъект[ИмяТабличнойЧасти].Количество() = 0 Тогда        
		Возврат НомерПервойЗаписи;    
	КонецЕсли;
	
	МаксНомерСтроки = 0; 
	
	Для каждого СтрокаТЧ Из ДокументОбъект[ИмяТабличнойЧасти] Цикл            
		МаксНомерСтроки = Макс(МаксНомерСтроки, СтрокаТЧ[ИмяРеквизитаПорядковыйНомер]);        
	КонецЦикла;
	
	НомерСтроки = МаксНомерСтроки + 1;
	Если НомерСтроки = 1 Тогда 
		Возврат НомерПервойЗаписи;
	Иначе		
		Возврат НомерСтроки;
	КонецЕсли;
	
	
КонецФункции

	
#КонецОбласти