#Область ПрограммныйИнтерфейс

// Проверяет, выбран-ли из списка формы  именно контрагент, а не группа или элемент группировки.
//
// Параметры:
//  Форма          	-  УправляемаяФорма - форма, для которой выполняются действия.
//  ИмяСписка	 	- Имя списка формы - содержит данные списка Контрагентов.
//
&НаКлиенте
Функция КонтрагентИзСпискаВыбранКорректно(Форма,ИмяСписка)Экспорт 
	
	КонирагентВыбранКоректно = Истина;
	Если Форма.Элементы[ИмяСписка].ТекущиеДанные =  Неопределено
		ИЛИ ТипЗнч(Форма.Элементы[ИмяСписка].ТекущаяСтрока) <>  Тип("СправочникСсылка.Контрагенты") 
		ИЛИ КонтрагентыВызовСервера.ВыбранаГруппаСправочникаКонтрагента(Форма.Элементы[ИмяСписка].ТекущаяСтрока) Тогда
		
		КонирагентВыбранКоректно =  Ложь; 
		
	КонецЕсли;  
	
	Возврат КонирагентВыбранКоректно;
	
КонецФункции


#КонецОбласти