
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НастроитьЭлементыФормы();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	Если  СправочникиСервер.ИмеетсяДвойникВСправочнике(ТекущийОбъект,"Наименование, ВидДокумента")  Тогда 	
		
		ТекстСообщения = НСтр("ru = 'Отказ в записи элемента.
									|Базовый проект с таким наименованием уже существует в информационной базе.
									|Необходимо указать другую информацию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Наименование",,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти    

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	
	НастроитьЗаголовокПоляВводаНаименованиеДокумента();   
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	СтроковыеФункцииКлиентСервер.УдалитьЛишниеПробелы(Объект.Наименование);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

&НаСервере
Процедура НастроитьЗаголовокПоляВводаНаименованиеДокумента()
	
	ВидДокумента = Объект.ВидДокумента;
	Если 	ВидДокумента = Перечисления.ВидДокумента.АктОтбраковки 
		Или ВидДокумента = Перечисления.ВидДокумента.АктРевизииИОтбраковки 
		Или ВидДокумента = Перечисления.ВидДокумента.АктТехническогоСостоянияОборудования Тогда
		Элементы.Наименование.Заголовок = "Наименование АКТА";
	ИначеЕсли ВидДокумента = Перечисления.ВидДокумента.ВедомостьОбъемаРабот Тогда
		Элементы.Наименование.Заголовок = "Наименование ВОР.";
	ИначеЕсли ВидДокумента = Перечисления.ВидДокумента.ДефектнаяВедомость Тогда
		Элементы.Наименование.Заголовок = "Наименование Д.В.";  
	ИначеЕсли ВидДокумента = Перечисления.ВидДокумента.ДополнительнаяДефектнаяВедомость Тогда
		Элементы.Наименование.Заголовок = "Наименование Доп.Д.В.";  
	ИначеЕсли ВидДокумента = Перечисления.ВидДокумента.Проект Тогда
		Элементы.Наименование.Заголовок = "Шифр проекта";
	ИначеЕсли ВидДокумента = Перечисления.ВидДокумента.ППР Тогда
		Элементы.Наименование.Заголовок = "Наименование ППР";	
	Иначе	    
		Элементы.Наименование.Заголовок = "Заголовок документа";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()
	
	НастроитьЗаголовокПоляВводаНаименованиеДокумента();
	        
КонецПроцедуры

 #КонецОбласти 
