
#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	Поля.Добавить("ПолноеНаименование");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
		
	Если Данные.Свойство("ПолноеНаименование") 
		И ТипЗнч(Данные.ПолноеНаименование) = Тип("Строка") Тогда
		
		Представление = Данные.ПолноеНаименование;    
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
