#Область ПрограммныйИнтерфейс

Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт

КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей, ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт 
	
	Товары = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления); // ТаблицаЗначений
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных); // ТаблицаЗначений  
	
	УдалитьЛишниеСимволыВЗагружаемыхДанных(ЗагружаемыеДанные);
		
	ТЗНоменклатура = ЗагружаемыеДанные.Скопировать();
	ТЗНоменклатура.Свернуть("НоменклатураПоставщика"); 
		
	ТЗЕдиницыИзмерения = ЗагружаемыеДанные.Скопировать();
	ТЗЕдиницыИзмерения.Свернуть("ЕдиницаИзмерения"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(Номенклатура.Ссылка) КАК СсылкаНоменклатуры
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ПолноеНаименование В(&ТЗНоменклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.ПолноеНаименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(КлассификаторЕдиницИзмерений.Ссылка) КАК СсылкаЕдиницыИзмерения
	|ПОМЕСТИТЬ ВТЕдиницыИзмерения
	|ИЗ
	|	Справочник.КлассификаторЕдиницИзмерений КАК КлассификаторЕдиницИзмерений
	|ГДЕ
	|	КлассификаторЕдиницИзмерений.Наименование В(&ТЗЕдиницыИзмерения)
	|
	|СГРУППИРОВАТЬ ПО
	|	КлассификаторЕдиницИзмерений.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗМатериалы.Идентификатор КАК Идентификатор,
	|	ВЫРАЗИТЬ(ТЗМатериалы.НоменклатураПоставщика КАК СТРОКА(440)) КАК НоменклатураПоставщика,
	|	ВЫРАЗИТЬ(ТЗМатериалы.Количество КАК СТРОКА(20)) КАК Количество,
	|	ВЫРАЗИТЬ(ТЗМатериалы.ЕдиницаИзмерения КАК СТРОКА(10)) КАК ЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(ТЗМатериалы.Цена КАК СТРОКА(20)) КАК Цена
	|ПОМЕСТИТЬ ВТМатериалы
	|ИЗ
	|	&ТЗМатериалы КАК ТЗМатериалы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТМатериалы.Идентификатор КАК Идентификатор,
	|	ЕСТЬNULL(ВТНоменклатура.СсылкаНоменклатуры, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ВТЕдиницыИзмерения.СсылкаЕдиницыИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерений.ПустаяСсылка)) КАК ЕдиницаИзмерения,
	|	ВТМатериалы.Количество КАК Количество,
	|	ВТМатериалы.Цена КАК Цена,
	|	ВТМатериалы.НоменклатураПоставщика КАК НоменклатураПоставщика
	|ИЗ
	|	ВТМатериалы КАК ВТМатериалы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНоменклатура КАК ВТНоменклатура
	|		ПО ВТМатериалы.НоменклатураПоставщика = ВТНоменклатура.СсылкаНоменклатуры.ПолноеНаименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЕдиницыИзмерения КАК ВТЕдиницыИзмерения
	|		ПО ВТМатериалы.ЕдиницаИзмерения = ВТЕдиницыИзмерения.СсылкаЕдиницыИзмерения.Наименование";
	
	Запрос.УстановитьПараметр("ТЗМатериалы", ЗагружаемыеДанные);
	Запрос.УстановитьПараметр("ТЗЕдиницыИзмерения", ТЗЕдиницыИзмерения);
	Запрос.УстановитьПараметр("ТЗНоменклатура", ТЗНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗРезультат = РезультатЗапроса.Выбрать(); 
	
	Пока ТЗРезультат.Следующий() Цикл
		
		СтрокаТовары = Товары.Добавить();   
		СтрокаТовары.Идентификатор = ТЗРезультат.Идентификатор;
		
		Если  ЗначениеЗаполнено(ТЗРезультат.ЕдиницаИзмерения) Тогда 
			
			СтрокаТовары.ЕдиницаИзмерения =   ТЗРезультат.ЕдиницаИзмерения;   
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТЗРезультат.Номенклатура) Тогда
			
			// Создать номенклатуру в справочнике
			ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();
			ЭлементСправочника.ПолноеНаименование = ТЗРезультат.НоменклатураПоставщика;
			ЭлементСправочника.Записать(); 
			СтрокаТовары.НоменклатураПоставщика = ЭлементСправочника.Ссылка;
			
		Иначе
			
			СтрокаТовары.НоменклатураПоставщика =  ТЗРезультат.Номенклатура;
			
		КонецЕсли;
			
		СтрокаТовары.Цена = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТЗРезультат.Цена);
		СтрокаТовары.Количество = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТЗРезультат.Количество);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Товары, АдресТаблицыСопоставления);

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

  Процедура УдалитьЛишниеСимволыВЗагружаемыхДанных(ЗагружаемыеДанные)
	
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		
		СтроковыеФункцииКлиентСервер.УдалитьЛишниеСимволы(СтрокаТаблицы.НоменклатураПоставщика); 
				
		СтроковыеФункцииКлиентСервер.УдалитьЛишниеСимволы(СтрокаТаблицы.ЕдиницаИзмерения);	
		СтрокаТаблицы.ЕдиницаИзмерения = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(СтрокаТаблицы.ЕдиницаИзмерения,".","Справа");
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
