#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  
	
	Если Не СтроковыеФункцииКлиентСервер.ВСтрокеЕстьБуквыИлиЦифры(ТекущийОбъект.ПолноеНаименование) Тогда 
		
		ТекстСообщения = НСтр("ru = 'Отказ в записи элемента.
		|Дополнительный характеристики номенклатуры указаны некорректно.
		|В наименовании должна присутствовать хотя бы одна буква или цифра.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ПолноеНаименование",,Отказ);
		Возврат;
		
	КонецЕсли;
		
	Если  СправочникиСервер.ИмеетсяДвойникВСправочнике(ТекущийОбъект,"ПолноеНаименование" )  Тогда 
		
		ТекстСообщения = НСтр("ru = 'Отказ в записи элемента.
		|Дополнительный характеристики номенклатуры с таким наименованием уже существует в информационной базе.
		|Необходимо указать другую информацию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ПолноеНаименование",,Отказ);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолноеНаименованиеПриИзменении(Элемент)
	
	Объект.ПолноеНаименование = СтрЗаменить(Объект.ПолноеНаименование, Символы.ПС, "");  
	Объект.ПолноеНаименование = СтрЗаменить(Объект.ПолноеНаименование, Символы.ВК, "");  
	Объект.ПолноеНаименование = СтрЗаменить(Объект.ПолноеНаименование, Символ(160), " "); 
	СтроковыеФункцииКлиентСервер.УдалитьЛишниеПробелы(Объект.ПолноеНаименование); 
	
КонецПроцедуры

#КонецОбласти