
#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если  СправочникиСервер.ИмеетсяДвойникВСправочнике(ТекущийОбъект)  Тогда 	
		
		ТекстСообщения = НСтр("ru = 'Отказ в записи элемента.
								|Базовый раздел проекта с таким наименованием уже существует в информационной базе.
								|Необходимо указать другую информацию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Наименование",,Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры   

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)     

	Объект.Наименование = СтрЗаменить(Объект.Наименование," ","");
	Объект.Наименование = СтрЗаменить(Объект.Наименование,",",".");
	
КонецПроцедуры

#КонецОбласти 
