#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("ВнутреннийЗаказ") Тогда 	
			Список.Параметры.УстановитьЗначениеПараметра("ВнутреннийЗаказ", Параметры.Отбор.ВнутреннийЗаказ);
			ВнутреннийЗаказ = Параметры.Отбор.ВнутреннийЗаказ;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("Номенклатура") Тогда 	
			Список.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Отбор.Номенклатура);
			Номенклатура = Параметры.Отбор.Номенклатура;
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ДополнительныеХарактеристикиНоменклатуры") Тогда	
			Список.Параметры.УстановитьЗначениеПараметра("ДополнительныеХарактеристикиНоменклатуры", Параметры.Отбор.ДополнительныеХарактеристикиНоменклатуры);
			ДополнительныеХарактеристикиНоменклатуры = Параметры.Отбор.ДополнительныеХарактеристикиНоменклатуры;	
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ЕдиницаИзмерения") Тогда	
			Список.Параметры.УстановитьЗначениеПараметра("ЕдиницаИзмерения", Параметры.Отбор.ЕдиницаИзмерения);
			ЕдиницаИзмерения = Параметры.Отбор.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
