#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если  СправочникиСервер.ИмеетсяДвойникВСправочнике(ТекущийОбъект)  Тогда 	
		
		ТекстСообщения = НСтр("ru = 'Отказ в записи элемента.
									|Регион с таким названием уже существует в информационной базе.
									|Необходимо указать другую информацию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.Наименование",,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы  

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	СтроковыеФункцииКлиентСервер.УдалитьЛишниеПробелы(Объект.Наименование);
КонецПроцедуры

#КонецОбласти