
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Если ТипЗнч(ПараметрКоманды) <> Тип("СправочникСсылка.Организации")
		ИЛИ ОрганизацияПоУмолчанию() = ПараметрКоманды Тогда   
		
		Возврат;  
		
	КонецЕсли;
			
	УстановитьОрганизациюПоУмолчанию(ПараметрКоманды);
		
	Оповестить("Запись_КонстантыОрганизацияПоУмолчанию"); 
	
КонецПроцедуры  


&НаСервере
Процедура УстановитьОрганизациюПоУмолчанию(Организация) 
	
	Константы.ОрганизацияПоУмолчанию.Установить(Организация);	
	
КонецПроцедуры    

 &НаСервере
Функция ОрганизацияПоУмолчанию() 
	
	Возврат ОрганизацииСерверУЗ.ОганизацияПоУмолчанию();	
	
КонецФункции   


