
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	
	Если ВидФормы = "ФормаОбъекта" Тогда 
		
		СтандартнаяОбработка = Ложь;   
		
		
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "Наименование");	
		Если СтрНачинаетсяС(Наименование, "Распределить") Тогда
			ВыбраннаяФорма = "Задача.ЗадачиИсполнителейОМТС.Форма.ФормаЗадачиРаспределитьЗаказПоИсполнителям"; 
			
		ИначеЕсли СтрНачинаетсяС(Наименование, "Подтвердить") Тогда			
			ВыбраннаяФорма = "Задача.ЗадачиИсполнителейОМТС.Форма.ФормаЗадачиПодтвердитьРаспределениеЗаказаПоИсполнителю";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
