#Область ОбработчикиСобытийФормы    

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если  СправочникиСервер.ИмеетсяДвойникВСправочнике(Объект,"ПолноеНаименование" )  Тогда 	
		ТекстСообщения = НСтр("ru = 'Отказ в записи элемента.
		|Номенклатура с таким наименованием и дополнительными данными уже существует в информационной базе.
		|Необходимо указать другую информацию.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,"Объект.ПолноеНаименование",,Отказ);
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Объект"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы   

&НаКлиенте
Процедура ПолноеНаименованиеПриИзменении(Элемент)
	
	СтроковыеФункцииКлиентСервер.УдалитьЛишниеСимволы(Объект.ПолноеНаименование);
	
КонецПроцедуры

 #КонецОбласти

